{
  "predict.predict": {
    "traces": [],
    "train": [],
    "demos": [],
    "signature": {
      "instructions": "# Task: Emotion Classification from Sentences with Nuanced Emotional Analysis\n\n# Input Format:\n# A single field 'sentence' containing a sentence of text, which may express a single or multiple emotions.\n\n# Task Description:\n# Given a sentence, classify the emotional tone of the sentence into one of the following categories:\n# - Neutral\n# - Happy\n# - Sad\n# - Joy\n# - Anger\n# - Consider the nuances of emotional language, including idioms, sarcasm, and figurative language.\n# - Handle cases where the sentence expresses multiple emotions simultaneously.\n# - Be sensitive to cultural and individual differences in emotional expression.\n\n# Task Strategy:\n# 1. Tokenize the input sentence into words or tokens, considering punctuation and special characters.\n# 2. Analyze the sentiment of each token using Natural Language Processing (NLP) techniques, such as part-of-speech tagging, named entity recognition, and dependency parsing.\n# 3. Identify emotional keywords and phrases, including emotive language, idioms, and figurative expressions.\n# 4. Aggregate the sentiment of individual tokens to determine the overall emotional tone of the sentence, considering contextual factors and emotional nuances.\n# 5. Map the overall emotional tone to one of the specified categories, taking into account the presence of multiple emotions.\n\n# Task Constraints:\n# - Only consider the emotional tone and ignore any factual or informative content in the sentence.\n# - Use a granular approach to emotion classification, rather than a broad categorization (e.g., positive/negative).\n# - Be aware of cultural and individual differences in emotional expression, and handle cases where the sentence may be ambiguous or open to interpretation.\n\n# Task Considerations:\n# - Use a reliable and widely accepted NLP library or framework for sentiment analysis, such as NLTK, spaCy, or Stanford CoreNLP.\n# - Consider the use of machine learning models, such as support vector machines, random forests, or neural networks, to improve the accuracy of emotion classification.\n# - Handle cases where the input sentence is empty, null, or contains non-text data.\n```\n\n```python\n# Additional Considerations:\n\n# - Be aware of the nuances of emotional language, including:\n#   * Idioms: phrases with a figurative meaning that is different from the literal meaning of individual words.\n#   * Sarcasm: language that expresses the opposite of what is meant, often to be ironic or mocking.\n#   * Figurative language: language that uses non-literal expressions to convey meaning, such as metaphors, similes, and hyperbole.\n# - Handle cases where the sentence expresses multiple emotions simultaneously, such as \"I'm happy for you, but also a little sad.\"\n# - Be sensitive to cultural and individual differences in emotional expression, and handle cases where the sentence may be ambiguous or open to interpretation.",
      "fields": [
        {
          "prefix": "Sentence:",
          "description": "${sentence}"
        },
        {
          "prefix": "Reasoning: Let's think step by step in order to",
          "description": "${reasoning}"
        },
        {
          "prefix": "Emotion:",
          "description": "${emotion}"
        }
      ]
    },
    "lm": null
  },
  "metadata": {
    "dependency_versions": {
      "python": "3.12",
      "dspy": "3.1.0",
      "cloudpickle": "3.1"
    }
  }
}
