{
  "predict.predict": {
    "traces": [],
    "train": [],
    "demos": [],
    "signature": {
      "instructions": "# Task Instruction\n# Task Description:\n#  Classify the emotional tone of a given sentence.\n#  The emotional tone can be neutral, happy, sad, or other emotions.\n#  The task input is a single sentence.\n#  The task output is the emotional tone of the sentence, which is a single label from the set {neutral, happy, sad}.\n#  The assistant should also provide a brief explanation for the classification, focusing on the linguistic features that led to the chosen emotion label.\n\n# Task Input Format:\n#  The task input is a dictionary with a single key-value pair.\n#  The key is 'sentence' and the value is the input sentence.\n#  The input sentence can contain any type of text, including but not limited to words, phrases, punctuation, and emoticons.\n\n# Task Specific Factual Information:\n#  * The emotional tone of a sentence can be influenced by linguistic features such as:\n#    + Words and phrases with positive connotations (e.g. \"love\", \"amazing\")\n#    + Words and phrases with negative connotations (e.g. \"terrible\", \"sad\")\n#    + Emotional expressions (e.g. \"I'm happy\", \"I'm feeling sad\")\n#    + Tone markers (e.g. \"haha\", \"sigh\")\n#    + Contextual information (e.g. the speaker's intentions, the situation described)\n#  * The emotional tone of a sentence can also be influenced by the presence of emoticons or emojis (e.g. 😊, 😔)\n\n# Task Generalizable Strategy:\n#  The task can be solved using a combination of Natural Language Processing (NLP) techniques, such as:\n#    + Tokenization: breaking down the input sentence into individual words or tokens\n#    + Part-of-speech tagging: identifying the grammatical categories of each token\n#    + Named entity recognition: identifying specific entities mentioned in the sentence (e.g. names, locations)\n#    + Sentiment analysis: determining the overall sentiment of the sentence\n\n# Task Instruction\nGiven the fields `sentence`, perform the following tasks:\n1. Tokenize the input sentence into individual words or tokens.\n2. Identify the linguistic features that may influence the emotional tone of the sentence, such as:\n        * Words and phrases with positive or negative connotations\n        * Emotional expressions\n        * Tone markers\n3. Determine the overall sentiment of the sentence using sentiment analysis techniques.\n4. Classify the emotional tone of the sentence based on the identified linguistic features and sentiment.\n5. Provide a brief explanation for the classification, focusing on the linguistic features that led to the chosen emotion label.\n6. Output the emotional tone of the sentence, which is a single label from the set {neutral, happy, sad}.\n\nOutput Format:\nThe task output should be a dictionary with two key-value pairs:\n* 'emotion': the emotional tone of the sentence, which is a single label from the set {neutral, happy, sad}\n* 'reasoning': a brief explanation for the classification, focusing on the linguistic features that led to the chosen emotion label",
      "fields": [
        {
          "prefix": "Sentence:",
          "description": "${sentence}"
        },
        {
          "prefix": "Reasoning: Let's think step by step in order to",
          "description": "${reasoning}"
        },
        {
          "prefix": "Emotion:",
          "description": "${emotion}"
        }
      ]
    },
    "lm": null
  },
  "metadata": {
    "dependency_versions": {
      "python": "3.12",
      "dspy": "3.1.0",
      "cloudpickle": "3.1"
    }
  }
}
